_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
inputs (InputLayer)          (None, 60000, 1)          0
_________________________________________________________________
Layer_1_Convolution1 (Conv1D (None, 59996, 64)         384
_________________________________________________________________
Layer_1_Convolution2 (Conv1D (None, 59992, 128)        41088
_________________________________________________________________
batch_normalization_1 (Batch (None, 59992, 128)        512
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 29996, 128)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 29996, 128)        0
_________________________________________________________________
Layer_2_Convolution1 (Conv1D (None, 29990, 128)        114816
_________________________________________________________________
Layer_2_Convolution2 (Conv1D (None, 29984, 256)        229632
_________________________________________________________________
batch_normalization_2 (Batch (None, 29984, 256)        1024
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 14992, 256)        0
_________________________________________________________________
dropout_2 (Dropout)          (None, 14992, 256)        0
_________________________________________________________________
Layer_3_Convolution1 (Conv1D (None, 14986, 256)        459008
_________________________________________________________________
Layer_3_Convolution2 (Conv1D (None, 14980, 64)         114752
_________________________________________________________________
batch_normalization_3 (Batch (None, 14980, 64)         256
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 7490, 64)          0
_________________________________________________________________
dropout_3 (Dropout)          (None, 7490, 64)          0
_________________________________________________________________
Layer_4_Convolution1 (Conv1D (None, 7484, 256)         114944
_________________________________________________________________
Layer_4_Convolution2 (Conv1D (None, 7478, 64)          114752
_________________________________________________________________
batch_normalization_4 (Batch (None, 7478, 64)          256
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 3739, 64)          0
_________________________________________________________________
dropout_4 (Dropout)          (None, 3739, 64)          0
_________________________________________________________________
Layer_5_Convolution1 (Conv1D (None, 3738, 8)           1032
_________________________________________________________________
Layer_5_Convolution2 (Conv1D (None, 3737, 8)           136
_________________________________________________________________
batch_normalization_5 (Batch (None, 3737, 8)           32
_________________________________________________________________
max_pooling1d_5 (MaxPooling1 (None, 1868, 8)           0
_________________________________________________________________
dropout_5 (Dropout)          (None, 1868, 8)           0
_________________________________________________________________
flatten_1 (Flatten)          (None, 14944)             0
_________________________________________________________________
dense_1 (Dense)              (None, 64)                956480
_________________________________________________________________
dropout_6 (Dropout)          (None, 64)                0
_________________________________________________________________
dense_2 (Dense)              (None, 32)                2080
_________________________________________________________________
dropout_7 (Dropout)          (None, 32)                0
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 66
=================================================================
Total params: 2,151,250
Trainable params: 2,150,210
Non-trainable params: 1,040
_________________________________________________________________